from aiogram.types import ReplyKeyboardMarkup, KeyboardButton


def teacher_keyboard(grade, major, institute, subject):

    kb = ReplyKeyboardMarkup(resize_keyboard=True)

    # استانداردسازی نام درس‌ها
    subject_map = {
        "زیست": "زیست شناسی",
        "علوم و فنون": "علوم و فنون ادبی",
        "روانشناسی": "روان شناسی",
        "دینی": "دین و زندگی",
        "ادبیات": "فارسی",
    }
    subject = subject_map.get(subject, subject)

    data = {
        "ماز": {
            ("دهم", "انسانی", "علوم و فنون ادبی"): ["عماد فیض آبادی"],
            ("دهم", "انسانی", "ریاضی و آمار"): ["محمد یگانه", "علی فضلی‌خانی"],
            ("دهم", "انسانی", "جامعه شناسی"): ["مژده طالب"],
            ("دهم", "انسانی", "منطق"): ["محمدمهدی تفقدی"],
            ("دهم", "انسانی", "عربی"): ["علی فرامرزی"],
            ("دهم", "انسانی", "اقتصاد"): ["میترا چینی‌ساز", "سجاد گلاب"],
            ("دهم", "انسانی", "زبان انگلیسی"): ["علی قیومی", "ارشاد عظیمی"],
            ("دهم", "انسانی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            ("دهم", "انسانی", "دین و زندگی"): ["مرتضی محسنی‌کبیر"],
            
            ("دهم", "ریاضی", "هندسه"): ["نرگس کارگر", "محمدحسین واعظین"],
            ("دهم", "ریاضی", "شیمی"): ["فرشاد هادیان‌فرد", "محمدعلی مومن زاده"],
            ("دهم", "ریاضی", "فیزیک"): ["محمدرضا شجاعی"],
            ("دهم", "ریاضی", "ریاضی"): ["مهدی عزیزی"],
            ("دهم", "ریاضی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            ("دهم", "ریاضی", "عربی"): ["مهدی ترابی"],
            
            ("دهم", "تجربی", "زیست شناسی"): ["امید غلامی", "پوریا خیراندیش"],
            ("دهم", "تجربی", "شیمی"): ["فرشاد هادیان‌فرد", "محمدعلی مومن‌زاده"],
            ("دهم", "تجربی", "ریاضی"): ["مهدی عزیزی"],
            ("دهم", "تجربی", "فیزیک"): ["محمدرضا شجاعی"],
            ("دهم", "تجربی", "عربی"): ["مهدی ترابی"],
            ("دهم", "تجربی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            
            ("یازدهم", "انسانی", "ریاضی و آمار"): ["محمد یگانه", "علی فضلی‌خانی"],
            ("یازدهم", "انسانی", "علوم و فنون ادبی"): ["علیرضا بدیع"],
            ("یازدهم", "انسانی", "روان شناسی"): ["مژده طالب", "نگین تربتی"],
            ("یازدهم", "انسانی", "جامعه شناسی"): ["مژده طالب"],
            ("یازدهم", "انسانی", "فلسفه"): ["مجتبی علی‌اکبر"],
            ("یازدهم", "انسانی", "عربی تخصصی"): ["کیارش پورمهدی", "علی فرامرزی"],
            ("یازدهم", "انسانی", "دین و زندگی"): ["مرتضی محسنی‌کبیر"],
            ("یازدهم", "انسانی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            
            ("یازدهم", "ریاضی", "هندسه"): ["کیوان دارابی", "محمدحسین واعظین"],
            ("یازدهم", "ریاضی", "فیزیک"): ["محمدرضا شجاعی"],
            ("یازدهم", "ریاضی", "آمار و احتمال"): ["علیرضا شریف‌خطیبی", "کیوان دارابی"],
            ("یازدهم", "ریاضی", "شیمی"): ["فرشاد هادیان‌فرد"],
            ("یازدهم", "ریاضی", "حسابان"): ["مهدی عزیزی", "عباس اشرفی", "احسان ایزدپناه"],
            ("یازدهم", "ریاضی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            
            ("یازدهم", "تجربی", "شیمی"): ["فرشاد هادیان‌فرد"],
            ("یازدهم", "تجربی", "ریاضی"): ["مهدی عزیزی", "احسان ایزدپناه", "عباس اشرفی"],
            ("یازدهم", "تجربی", "فیزیک"): ["محمدرضا شجاعی"],
            ("یازدهم", "تجربی", "زیست شناسی"): ["پوریا خیراندیش", "فرزام فرهمندنیا"],
            ("یازدهم", "تجربی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            
            ("دوازدهم", "انسانی", "ریاضی و آمار"): ["محمد یگانه", "معین کرمی"],
            ("دوازدهم", "انسانی", "علوم و فنون ادبی"): ["عماد فیض‌آبادی", "علیرضا بدیع"],
            ("دوازدهم", "انسانی", "روان شناسی"): ["مژده طالب", "نگین تربتی"],
            ("دوازدهم", "انسانی", "جامعه شناسی"): ["مژده طالب", "فروغ تیموریان"],
            ("دوازدهم", "انسانی", "فلسفه و منطق"): ["محمدمهدی تفقدی", "مجتبی علی‌‌‌‌اکبر"],
            ("دوازدهم", "انسانی", "عربی تخصصی"): ["محمدمهدی شاهرودی", "کیارش پورمهدی"],
            ("دوازدهم", "انسانی", "اقتصاد"): ["سجاد گلاب", "میترا چینی‌ساز"],
            ("دوازدهم", "انسانی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            ("دوازدهم", "انسانی", "دین و زندگی"): ["فرزاد صائلی", "مرتضی محسنی‌کبیر"],
            
            ("دوازدهم", "ریاضی", "هندسه"): ["کیوان دارابی", "محمدحسین واعظین"],
            ("دوازدهم", "ریاضی", "فیزیک"): ["محمدرضا شجاعی"],
            ("دوازدهم", "ریاضی", "حسابان"): ["معین کرمی", "مهدی عزیزی"],
            ("دوازدهم", "ریاضی", "شیمی"): ["فرشاد هادیان‌فرد", "بهمن بازرگانی"],
            ("دوازدهم", "ریاضی", "گسسته"): ["کیوان دارابی", "احسان ایزدپناه"],
            ("دوازدهم", "ریاضی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            
            ("دوازدهم", "تجربی", "زیست شناسی"): ["پوریا خیراندیش", "فرزاد فرهمندنیا"],
            ("دوازدهم", "تجربی", "فیزیک"): ["محمدرضا شجاعی"],
            ("دوازدهم", "تجربی", "شیمی"): ["فرشاد هادیان‌فرد", "بهمن بازرگانی"],
            ("دوازدهم", "تجربی", "ریاضی"): ["معین کرمی"],
            ("دوازدهم", "تجربی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
        },
        
        "آلفا اسکول": {
            ("دهم", "تجربی", "ریاضی"): ["معین کرمی"],
            ("دهم", "تجربی", "زیست شناسی"): ["زرندی"],
            ("دهم", "تجربی", "فیزیک"): ["میری"],
            ("دهم", "تجربی", "شیمی"): ["طهرانچی"],
            
            ("دهم", "ریاضی", "ریاضی"): ["معین کرمی"],
            ("دهم", "ریاضی", "هندسه"): ["عمید"],
            ("دهم", "ریاضی", "فیزیک"): ["میری"],
            ("دهم", "ریاضی", "شیمی"): ["طهرانچی"],
            
            ("یازدهم", "تجربی", "ریاضی"): ["معین کرمی"],
            ("یازدهم", "تجربی", "زیست شناسی"): ["زرندی"],
            ("یازدهم", "تجربی", "فیزیک"): ["میری"],
            ("یازدهم", "تجربی", "شیمی"): ["طهرانچی"],
            ("یازدهم", "تجربی", "فارسی"): ["بهابادی"],
            
            ("یازدهم", "ریاضی", "حسابان"): ["معین کرمی"],
            ("یازدهم", "ریاضی", "هندسه"): ["عمید"],
            ("یازدهم", "ریاضی", "آمار و احتمال"): ["عمید"],
            ("یازدهم", "ریاضی", "فیزیک"): ["میری"],
            ("یازدهم", "ریاضی", "شیمی"): ["طهرانچی"],
            ("یازدهم", "ریاضی", "فارسی"): ["بهابادی"],
            
            ("دوازدهم", "تجربی", "ریاضی"): ["معین کرمی"],
            ("دوازدهم", "تجربی", "زیست شناسی"): ["زرندی"],
            ("دوازدهم", "تجربی", "فیزیک"): ["میری"],
            ("دوازدهم", "تجربی", "شیمی"): ["طهرانچی"],
            ("دوازدهم", "تجربی", "فارسی"): ["بهابادی"],
            
            ("دوازدهم", "ریاضی", "حسابان"): ["معین کرمی"],
            ("دوازدهم", "ریاضی", "هندسه"): ["عمید"],
            ("دوازدهم", "ریاضی", "گسسته"): ["عمید"],
            ("دوازدهم", "ریاضی", "شیمی"): ["طهرانچی"],
            ("دوازدهم", "ریاضی", "فارسی"): ["بهابادی"],
            
            ("دوازدهم", "انسانی", "ریاضی و آمار"): ["معین کرمی"],
            ("دوازدهم", "انسانی", "علوم و فنون ادبی"): ["بهابادی"],
            ("دوازدهم", "انسانی", "فلسفه و منطق"): ["جلالی"],
            ("دوازدهم", "انسانی", "عربی"): ["ترکمان"],
            ("دوازدهم", "انسانی", "جامعه شناسی"): ["لجمیری"],
            ("دوازدهم", "انسانی", "روان شناسی"): ["رجبی"],
            ("دوازدهم", "انسانی", "تاریخ"): ["شفیعی"],
            ("دوازدهم", "انسانی", "جغرافیا"): ["شفیعی"],
            ("دوازدهم", "انسانی", "فارسی"): ["بهابادی"],
            ("دوازدهم", "انسانی", "دین و زندگی"): ["رضایی‌بقا"],
        },
        
        "تایتان": {
            ("دهم", "ریاضی", "شیمی"): ["فراهانی"],
            ("دهم", "تجربی", "شیمی"): ["فراهانی"],
        },
        
        "کلاسینو": {
            ("دهم", "ریاضی", "شیمی"): ["مرادی"],
            ("دهم", "ریاضی", "فیزیک"): ["نوکنده", "براتی"],
            ("دهم", "ریاضی", "ریاضی"): ["بابک سادات", "حمید پوراشرف"],
            ("دهم", "ریاضی", "هندسه"): ["جلالی"],
            ("دهم", "ریاضی", "فارسی"): ["یکتا"],
            
            ("دهم", "تجربی", "فارسی"): ["یکتا"],
            ("دهم", "تجربی", "شیمی"): ["مرادی"],
            ("دهم", "تجربی", "زیست شناسی"): ["حنیف", "فرهمند"],
            ("دهم", "تجربی", "فیزیک"): ["نوکنده", "براتی"],
            ("دهم", "تجربی", "ریاضی"): ["بابک سادات", "حمید پوراشرف"],
            
            ("دهم", "انسانی", "دین و زندگی"): ["فکری"],
            ("دهم", "انسانی", "اقتصاد"): ["اصغری", "عمار", "واعظی"],
            ("دهم", "انسانی", "جامعه شناسی"): ["اثباتی"],
            ("دهم", "انسانی", "ریاضی"): ["مهرخواه"],
            ("دهم", "انسانی", "فارسی"): ["یکتا"],
            ("دهم", "انسانی", "علوم و فنون ادبی"): ["یکتا"],
            ("دهم", "انسانی", "منطق"): ["فروغی‌نیا"],
            
            ("یازدهم", "تجربی", "شیمی"): ["مرادی"],
            ("یازدهم", "تجربی", "زیست شناسی"): ["فرهمند نیا", "حنیف"],
            ("یازدهم", "تجربی", "فیزیک"): ["براتی", "نوکنده"],
            ("یازدهم", "تجربی", "فارسی"): ["یکتا"],
            ("یازدهم", "تجربی", "ریاضی"): ["حیدری"],
            
            ("یازدهم", "ریاضی", "فارسی"): ["یکتا"],
            ("یازدهم", "ریاضی", "شیمی"): ["مرادی"],
            ("یازدهم", "ریاضی", "فیزیک"): ["نوکنده", "براتی"],
            ("یازدهم", "ریاضی", "هندسه"): ["جلالی", "صحت‌کار"],
            ("یازدهم", "ریاضی", "حسابان"): ["حیدری"],
            ("یازدهم", "ریاضی", "آمار و احتمال"): ["جلالی", "صحت‌کار"],
            
            ("یازدهم", "انسانی", "فارسی"): ["یکتا"],
            ("یازدهم", "انسانی", "دین و زندگی"): ["فکری"],
            ("یازدهم", "انسانی", "روان شناسی"): ["بهشتی"],
            ("یازدهم", "انسانی", "عربی تخصصی"): ["واعظی"],
            ("یازدهم", "انسانی", "جامعه شناسی"): ["اثباتی"],
            ("یازدهم", "انسانی", "ریاضی"): ["مهرخواه"],
            ("یازدهم", "انسانی", "علوم و فنون ادبی"): ["یکتا"],
            ("یازدهم", "انسانی", "فلسفه"): ["فروغی‌نیا"],
            
            ("دوازدهم", "ریاضی", "شیمی"): ["مرادی"],
            ("دوازدهم", "ریاضی", "فیزیک"): ["براتی", "نوکنده"],
            ("دوازدهم", "ریاضی", "هندسه"): ["جلالی", "صحت‌کار"],
            ("دوازدهم", "ریاضی", "گسسته"): ["جلالی", "صحت‌کار"],
            ("دوازدهم", "ریاضی", "حسابان"): ["حیدری"],
            ("دوازدهم", "ریاضی", "فارسی"): ["یکتا"],
            
            ("دوازدهم", "تجربی", "شیمی"): ["مرادی"],
            ("دوازدهم", "تجربی", "فیزیک"): ["براتی", "نوکنده"],
            ("دوازدهم", "تجربی", "زیست شناسی"): ["حنیف", "فرهمند"],
            ("دوازدهم", "تجربی", "ریاضی"): ["حیدری"],
            ("دوازدهم", "تجربی", "فارسی"): ["یکتا"],
            
            ("دوازدهم", "انسانی", "دین و زندگی"): ["فکری"],
            ("دوازدهم", "انسانی", "عربی"): ["واعظی"],
            ("دوازدهم", "انسانی", "فارسی"): ["یکتا"],
            ("دوازدهم", "انسانی", "جامعه شناسی"): ["اثباتی"],
            ("دوازدهم", "انسانی", "ریاضی"): ["حیدری"],
            ("دوازدهم", "انسانی", "فلسفه و منطق"): ["فروغی‌نیا"],
            ("دوازدهم", "انسانی", "روان شناسی"): ["بهشتی"],
            ("دوازدهم", "انسانی", "اقتصاد"): ["بهشتی"],
        }
    }

    inst_data = data.get(institute, {})

    teachers = []

    if isinstance(inst_data, dict):
        key = (grade.strip(), major.strip(), subject.strip())
        teachers = inst_data.get(key, [])

    if not teachers:
        return None

    for t in teachers:
        kb.add(KeyboardButton(t))

    return kb
