from aiogram.types import ReplyKeyboardMarkup, KeyboardButton
from database.core import get_db
from database.models import Publisher, Teacher
from sqlalchemy import select, func

async def teacher_keyboard(grade, major, institute, subject):
    """
    دریافت دبیران از دیتابیس
    اگر در دیتابیس نبود، از دیکشنری ثابت استفاده کن
    """
    
    # استانداردسازی نام درس‌ها (هماهنگ با subject_keyboard)
    subject_map = {
        "زیست": "زیست شناسی",
        "علوم و فنون": "علوم و فنون ادبی",
        "روانشناسی": "روان شناسی",
        "دینی": "دین و زندگی",
        "ادبیات": "فارسی",
    }
    subject = subject_map.get(subject, subject)

    grade = grade.strip()
    major = major.strip()
    institute = institute.strip()
    subject = " ".join(subject.split())

    # ===== ابتدا از دیتابیس بخوان =====
    async for db in get_db():
        pub = await db.scalar(
            select(Publisher).where(
                func.lower(Publisher.name) == func.lower(institute)
            )
        )

        if pub:
            result = await db.execute(
                select(Teacher).where(
                    Teacher.publisher_id == pub.id,
                    func.lower(Teacher.grade) == func.lower(grade),
                    func.lower(Teacher.major) == func.lower(major),
                    func.lower(Teacher.subject) == func.lower(subject)
                )
            )
            teachers = result.scalars().all()

            if teachers:
                kb = ReplyKeyboardMarkup(resize_keyboard=True)
                added = set()
                for t in teachers:
                    if t.name not in added:
                        kb.add(KeyboardButton(t.name))
                        added.add(t.name)
                return kb

    # ===== اگر در دیتابیس نبود، از دیکشنری ثابت استفاده کن =====
    kb = ReplyKeyboardMarkup(resize_keyboard=True)

    data = {
        "ماز": {
            ("دهم", "انسانی", "علوم و فنون ادبی"): ["عماد فیض آبادی"],
            ("دهم", "انسانی", "ریاضی و آمار"): ["محمد یگانه", "علی فضلی‌خانی"],
            ("دهم", "انسانی", "جامعه شناسی"): ["مژده طالب"],
            ("دهم", "انسانی", "منطق"): ["محمدمهدی تفقدی"],
            ("دهم", "انسانی", "عربی"): ["علی فرامرزی"],
            ("دهم", "انسانی", "اقتصاد"): ["میترا چینی‌ساز", "سجاد گلاب"],
            ("دهم", "انسانی", "زبان انگلیسی"): ["علی قیومی", "ارشاد عظیمی"],
            ("دهم", "انسانی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            ("دهم", "انسانی", "دین و زندگی"): ["مرتضی محسنی‌کبیر"],
            
            ("دهم", "ریاضی", "هندسه"): ["نرگس کارگر", "محمدحسین واعظین"],
            ("دهم", "ریاضی", "شیمی"): ["فرشاد هادیان‌فرد", "محمدعلی مومن زاده"],
            ("دهم", "ریاضی", "فیزیک"): ["محمدرضا شجاعی"],
            ("دهم", "ریاضی", "ریاضی"): ["مهدی عزیزی"],
            ("دهم", "ریاضی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            ("دهم", "ریاضی", "عربی"): ["مهدی ترابی"],
            
            ("دهم", "تجربی", "زیست شناسی"): ["امید غلامی", "پوریا خیراندیش"],
            ("دهم", "تجربی", "شیمی"): ["فرشاد هادیان‌فرد", "محمدعلی مومن‌زاده"],
            ("دهم", "تجربی", "ریاضی"): ["مهدی عزیزی"],
            ("دهم", "تجربی", "فیزیک"): ["محمدرضا شجاعی"],
            ("دهم", "تجربی", "عربی"): ["مهدی ترابی"],
            ("دهم", "تجربی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            
            ("یازدهم", "انسانی", "ریاضی و آمار"): ["محمد یگانه", "علی فضلی‌خانی"],
            ("یازدهم", "انسانی", "علوم و فنون ادبی"): ["علیرضا بدیع"],
            ("یازدهم", "انسانی", "روان شناسی"): ["مژده طالب", "نگین تربتی"],
            ("یازدهم", "انسانی", "جامعه شناسی"): ["مژده طالب"],
            ("یازدهم", "انسانی", "فلسفه"): ["مجتبی علی‌اکبر"],
            ("یازدهم", "انسانی", "عربی تخصصی"): ["کیارش پورمهدی", "علی فرامرزی"],
            ("یازدهم", "انسانی", "دین و زندگی"): ["مرتضی محسنی‌کبیر"],
            ("یازدهم", "انسانی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            
            ("یازدهم", "ریاضی", "هندسه"): ["کیوان دارابی", "محمدحسین واعظین"],
            ("یازدهم", "ریاضی", "فیزیک"): ["محمدرضا شجاعی"],
            ("یازدهم", "ریاضی", "آمار و احتمال"): ["علیرضا شریف‌خطیبی", "کیوان دارابی"],
            ("یازدهم", "ریاضی", "شیمی"): ["فرشاد هادیان‌فرد"],
            ("یازدهم", "ریاضی", "حسابان"): ["مهدی عزیزی", "عباس اشرفی", "احسان ایزدپناه"],
            ("یازدهم", "ریاضی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            
            ("یازدهم", "تجربی", "شیمی"): ["فرشاد هادیان‌فرد"],
            ("یازدهم", "تجربی", "ریاضی"): ["مهدی عزیزی", "احسان ایزدپناه", "عباس اشرفی"],
            ("یازدهم", "تجربی", "فیزیک"): ["محمدرضا شجاعی"],
            ("یازدهم", "تجربی", "زیست شناسی"): ["پوریا خیراندیش", "فرزام فرهمندنیا"],
            ("یازدهم", "تجربی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            
            ("دوازدهم", "انسانی", "ریاضی و آمار"): ["محمد یگانه", "معین کرمی"],
            ("دوازدهم", "انسانی", "علوم و فنون ادبی"): ["عماد فیض‌آبادی", "علیرضا بدیع"],
            ("دوازدهم", "انسانی", "روان شناسی"): ["مژده طالب", "نگین تربتی"],
            ("دوازدهم", "انسانی", "جامعه شناسی"): ["مژده طالب", "فروغ تیموریان"],
            ("دوازدهم", "انسانی", "فلسفه و منطق"): ["محمدمهدی تفقدی", "مجتبی علی‌اکبر"],
            ("دوازدهم", "انسانی", "عربی تخصصی"): ["محمدمهدی شاهرودی", "کیارش پورمهدی"],
            ("دوازدهم", "انسانی", "اقتصاد"): ["سجاد گلاب", "میترا چینی‌ساز"],
            ("دوازدهم", "انسانی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            ("دوازدهم", "انسانی", "دین و زندگی"): ["فرزاد صائلی", "مرتضی محسنی‌کبیر"],
            
            ("دوازدهم", "ریاضی", "هندسه"): ["کیوان دارابی", "محمدحسین واعظین"],
            ("دوازدهم", "ریاضی", "فیزیک"): ["محمدرضا شجاعی"],
            ("دوازدهم", "ریاضی", "حسابان"): ["معین کرمی", "مهدی عزیزی"],
            ("دوازدهم", "ریاضی", "شیمی"): ["فرشاد هادیان‌فرد", "بهمن بازرگانی"],
            ("دوازدهم", "ریاضی", "گسسته"): ["کیوان دارابی", "احسان ایزدپناه"],
            ("دوازدهم", "ریاضی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
            
            ("دوازدهم", "تجربی", "زیست شناسی"): ["پوریا خیراندیش", "فرزاد فرهمندنیا"],
            ("دوازدهم", "تجربی", "فیزیک"): ["محمدرضا شجاعی"],
            ("دوازدهم", "تجربی", "شیمی"): ["فرشاد هادیان‌فرد", "بهمن بازرگانی"],
            ("دوازدهم", "تجربی", "ریاضی"): ["معین کرمی"],
            ("دوازدهم", "تجربی", "فارسی"): ["علیرضا جعفری", "احسان محسنی"],
        },
        
        "آلفا اسکول": {
            ("دهم", "تجربی", "ریاضی"): ["معین کرمی"],
            ("دهم", "تجربی", "زیست شناسی"): ["زرندی"],
            ("دهم", "تجربی", "فیزیک"): ["میری"],
            ("دهم", "تجربی", "شیمی"): ["طهرانچی"],
            
            ("دهم", "ریاضی", "ریاضی"): ["معین کرمی"],
            ("دهم", "ریاضی", "هندسه"): ["عمید"],
            ("دهم", "ریاضی", "فیزیک"): ["میری"],
            ("دهم", "ریاضی", "شیمی"): ["طهرانچی"],
            
            ("یازدهم", "تجربی", "ریاضی"): ["معین کرمی"],
            ("یازدهم", "تجربی", "زیست شناسی"): ["زرندی"],
            ("یازدهم", "تجربی", "فیزیک"): ["میری"],
            ("یازدهم", "تجربی", "شیمی"): ["طهرانچی"],
            ("یازدهم", "تجربی", "فارسی"): ["بهابادی"],
            
            ("یازدهم", "ریاضی", "حسابان"): ["معین کرمی"],
            ("یازدهم", "ریاضی", "هندسه"): ["عمید"],
            ("یازدهم", "ریاضی", "آمار و احتمال"): ["عمید"],
            ("یازدهم", "ریاضی", "فیزیک"): ["میری"],
            ("یازدهم", "ریاضی", "شیمی"): ["طهرانچی"],
            ("یازدهم", "ریاضی", "فارسی"): ["بهابادی"],
            
            ("دوازدهم", "تجربی", "ریاضی"): ["معین کرمی"],
            ("دوازدهم", "تجربی", "زیست شناسی"): ["زرندی"],
            ("دوازدهم", "تجربی", "فیزیک"): ["میری"],
            ("دوازدهم", "تجربی", "شیمی"): ["طهرانچی"],
            ("دوازدهم", "تجربی", "فارسی"): ["بهابادی"],
            
            ("دوازدهم", "ریاضی", "حسابان"): ["معین کرمی"],
            ("دوازدهم", "ریاضی", "هندسه"): ["عمید"],
            ("دوازدهم", "ریاضی", "گسسته"): ["عمید"],
            ("دوازدهم", "ریاضی", "شیمی"): ["طهرانچی"],
            ("دوازدهم", "ریاضی", "فارسی"): ["بهابادی"],
            
            ("دوازدهم", "انسانی", "ریاضی و آمار"): ["معین کرمی"],
            ("دوازدهم", "انسانی", "علوم و فنون ادبی"): ["بهابادی"],
            ("دوازدهم", "انسانی", "فلسفه و منطق"): ["جلالی"],
            ("دوازدهم", "انسانی", "عربی"): ["ترکمان"],
            ("دوازدهم", "انسانی", "جامعه شناسی"): ["لجمیری"],
            ("دوازدهم", "انسانی", "روان شناسی"): ["رجبی"],
            ("دوازدهم", "انسانی", "تاریخ"): ["شفیعی"],
            ("دوازدهم", "انسانی", "جغرافیا"): ["شفیعی"],
            ("دوازدهم", "انسانی", "فارسی"): ["بهابادی"],
            ("دوازدهم", "انسانی", "دین و زندگی"): ["رضایی‌بقا"],
        },
        
        "تایتان": {
            ("دهم", "ریاضی", "شیمی"): ["فراهانی"],
            ("دهم", "تجربی", "شیمی"): ["فراهانی"],
            ("یازدهم", "ریاضی", "شیمی"): ["فراهانی"],
            ("یازدهم", "تجربی", "شیمی"): ["فراهانی"],
            ("دوازدهم", "ریاضی", "شیمی"): ["فراهانی"],
            ("دوازدهم", "تجربی", "شیمی"): ["فراهانی"],
        },
    }

    inst_data = data.get(institute, {})

    teachers = []

    if isinstance(inst_data, dict):
        key = (grade.strip(), major.strip(), subject.strip())
        teachers = inst_data.get(key, [])

    if not teachers:
        return None

    for t in teachers:
        kb.add(KeyboardButton(t))

    return kb
