TEACHERS = {

# ==================================
# ماز
# ==================================

# دهم انسانی
("ماز","دهم","انسانی","علوم و فنون ادبی"):
["عماد فیض آبادی"],

("ماز","دهم","انسانی","ریاضی و آمار"):
["محمد یگانه","علی فضلی خانی"],

("ماز","دهم","انسانی","جامعه شناسی"):
["مژده طالب"],

("ماز","دهم","انسانی","منطق"):
["محمدمهدی تفقدی"],

("ماز","دهم","انسانی","عربی"):
["علی فرامرزی"],

("ماز","دهم","انسانی","اقتصاد"):
["میترا چینی ساز","سجاد گلاب"],

("ماز","دهم","انسانی","زبان انگلیسی"):
["علی قیومی","ارشاد عظیمی"],

("ماز","دهم","انسانی","فارسی"):
["علیرضا جعفری","احسان محسنی"],

("ماز","دهم","انسانی","دین و زندگی"):
["مرتضی محسنی کبیر"],


# دهم ریاضی
("ماز","دهم","ریاضی","هندسه"):
["نرگس کارگر","محمد حسین واعظین"],

("ماز","دهم","ریاضی","شیمی"):
["فرشاد هادیان فرد","محمدعلی مومن زاده"],

("ماز","دهم","ریاضی","فیزیک"):
["محمدرضا شجاعی"],

("ماز","دهم","ریاضی","ریاضی"):
["مهدی عزیزی"],

("ماز","دهم","ریاضی","فارسی"):
["علیرضا جعفری","احسان محسنی"],

("ماز","دهم","ریاضی","عربی"):
["مهدی ترابی"],


# دهم تجربی
("ماز","دهم","تجربی","زیست"):
["امید غلامی","پوریا خیراندیش"],

("ماز","دهم","تجربی","شیمی"):
["فرشاد هادیان فرد","محمدعلی مومن زاده"],

("ماز","دهم","تجربی","ریاضی"):
["مهدی عزیزی"],

("ماز","دهم","تجربی","فیزیک"):
["محمدرضا شجاعی"],

("ماز","دهم","تجربی","عربی"):
["مهدی ترابی"],

("ماز","دهم","تجربی","فارسی"):
["علیرضا جعفری","احسان محسنی"],


# یازدهم انسانی
("ماز","یازدهم","انسانی","ریاضی و آمار"):
["محمد یگانه","علی فضلی خانی"],

("ماز","یازدهم","انسانی","علوم و فنون ادبی"):
["علیرضا بدیع"],

("ماز","یازدهم","انسانی","روان شناسی"):
["مژده طالب","نگین تربتی"],

("ماز","یازدهم","انسانی","جامعه شناسی"):
["مژده طالب"],

("ماز","یازدهم","انسانی","فلسفه"):
["مجتبی علی اکبر"],

("ماز","یازدهم","انسانی","عربی تخصصی"):
["کیارش پورمهدی","علی فرامرزی"],

("ماز","یازدهم","انسانی","دین و زندگی"):
["مرتضی محسنی کبیر"],

("ماز","یازدهم","انسانی","فارسی"):
["علیرضا جعفری","احسان محسنی"],


# یازدهم ریاضی
("ماز","یازدهم","ریاضی","هندسه"):
["کیوان دارابی","محمدحسین واعظین"],

("ماز","یازدهم","ریاضی","فیزیک"):
["محمدرضا شجاعی"],

("ماز","یازدهم","ریاضی","آمار و احتمال"):
["علیرضا شریف خطیبی","کیوان دارابی"],

("ماز","یازدهم","ریاضی","شیمی"):
["فرشاد هادیان فرد"],

("ماز","یازدهم","ریاضی","حسابان"):
["مهدی عزیزی","عباس اشرفی","احسان ایزدپناه"],

("ماز","یازدهم","ریاضی","فارسی"):
["علیرضا جعفری","احسان محسنی"],


# یازدهم تجربی
("ماز","یازدهم","تجربی","شیمی"):
["فرشاد هادیان فرد"],

("ماز","یازدهم","تجربی","ریاضی"):
["مهدی عزیزی","احسان ایزدپناه","عباس اشرفی"],

("ماز","یازدهم","تجربی","فیزیک"):
["محمدرضا شجاعی"],

("ماز","یازدهم","تجربی","زیست"):
["پوریا خیراندیش","فرزام فرهمندنیا"],

("ماز","یازدهم","تجربی","فارسی"):
["علیرضا جعفری","احسان محسنی"],


# دوازدهم انسانی
("ماز","دوازدهم","انسانی","ریاضی و آمار"):
["محمد یگانه","معین کرمی"],

("ماز","دوازدهم","انسانی","علوم و فنون ادبی"):
["عماد فیض آبادی","علیرضا بدیع"],

("ماز","دوازدهم","انسانی","فلسفه و منطق"):
["محمدمهدی تفقدی","مجتبی علی اکبر"],

("ماز","دوازدهم","انسانی","اقتصاد"):
["سجاد گلاب","میترا چینی ساز"],

("ماز","دوازدهم","انسانی","فارسی"):
["علیرضا جعفری","احسان محسنی"],


# دوازدهم ریاضی
("ماز","دوازدهم","ریاضی","هندسه"):
["کیوان دارابی","محمدحسین واعظین"],

("ماز","دوازدهم","ریاضی","فیزیک"):
["محمدرضا شجاعی"],

("ماز","دوازدهم","ریاضی","حسابان"):
["معین کرمی","مهدی عزیزی"],

("ماز","دوازدهم","ریاضی","شیمی"):
["فرشاد هادیان فرد","بهمن بازرگانی"],

("ماز","دوازدهم","ریاضی","گسسته"):
["کیوان دارابی","احسان ایزدپناه"],


# دوازدهم تجربی
("ماز","دوازدهم","تجربی","زیست"):
["پوریا خیراندیش","فرزاد فرهمندنیا"],

("ماز","دوازدهم","تجربی","فیزیک"):
["محمدرضا شجاعی"],

("ماز","دوازدهم","تجربی","شیمی"):
["فرشاد هادیان فرد","بهمن بازرگانی"],

("ماز","دوازدهم","تجربی","ریاضی"):
["معین کرمی"],


# ==================================
# تایتان
# ==================================

("تایتان","دهم","ریاضی","شیمی"):
["فراهانی"],

("تایتان","دهم","تجربی","شیمی"):
["فراهانی"],


# ==================================
# کلاسینو
# ==================================

("کلاسینو","دهم","تجربی","زیست"):
["🔥 حنیف و فرهمند بهترن 😊"],

("کلاسینو","یازدهم","تجربی","زیست"):
["😜 فرهمندنیا و حنیف بهترین"],

("کلاسینو","دوازدهم","تجربی","زیست"):
["😏 حنیف و فرهمند بهترن"]

}
